learning-ws/src/main/resources/Availability/GetDailyInventory/GetDailyInventoryRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <KwsSoapHeader xmlns="http://www.shijinet.com.cn/kunlun/kws/1.1/">
      <SessionId>string</SessionId>
      <RetCode>string</RetCode>
      <ErrReason>string</ErrReason>
    </KwsSoapHeader>
  </soap:Header>
  <soap:Body>
    <GetDailyInventory xmlns="http://www.shijinet.com.cn/kunlun/kws/1.1/">
      <hotel_code>string</hotel_code>
      <channel>string</channel>
      <dtBegin>dateTime</dtBegin>
      <dtEnd>dateTime</dtEnd>
      <room_type>string</room_type>
    </GetDailyInventory>
  </soap:Body>
</soap:Envelope>